#include <iostream>
#include <windows.h>
using namespace std;


int main()
{
    // створеня виведення українських символів
    SetConsoleCP(65001);
    SetConsoleOutputCP(65001);
	short i;
	bool exit = true;
	while (exit) {
		cout << "Виберіть завдання (1, 2 або 3) щоб вийти натисніть 4: ";
		cin >> i;
		switch (i) {
		case 1:
			cout << "Завдання 1. Вирішити дві задачі на алгоритми з розгалуженням." << endl << endl;
			cout << "1.1. Варіант: If 9" << endl;
			cout << "	Дано дві змінні дійсного типу: A, B." << endl;
			cout << "	Перерозподілити значення даних змінних так," << endl;
			cout << "	щоб в A було записано менше зі значень," << endl;
			cout << "	а в B – більше.Вивести нові значення змінних A і B." << endl << endl;

			double a, b;						//декларація змінних
			cout << "Введіть перше число A: ";	//Введення даних
			cin >> a;
			cout << "Введіть друге число B: ";
			cin >> b;
			if (a > b) {						//Виконання основної задачі
				swap(a, b);
			}
			cout << "\nМенше значення А: " << a << endl;		//Виведення результату
			cout << "Більше значення B: " << b << "\n\n\n";
			break;
		case 2:
			cout << "1.2. Варіант: If 12" << endl;
			cout << "	Дано три числа.Знайти найменше з них." << endl << endl;
			double c;							//декларація змінних
			cout << "Введіть перше число: ";	//Введення даних
			cin >> a;
			cout << "Введіть друге число: ";
			cin >> b;
			cout << "Введіть третє число: ";
			cin >> c;
			if (a < b && a < c) {				//Виконання основної задачі та виведення результату
				cout << "\nНайменше число: " << a << endl;
			}
			else if (b < a && b < c) {
				cout << "\nНайменше число: " << b << endl;
			}
			else {
				cout << "\nНайменше число: " << c << endl;
			}
			break;
		case 3:
			cout << "\n\n\nЗавдання 2. Належність точки до області" << endl << endl;
			cout << "Варіант: Figure 7" << endl;
			cout << "Область відділена прямими і колом" << endl;

			double x, y;								//декларація змінних
			cout << "\nВведіть сторону квадрата - а: ";	//Введення даних
			cin >> a;
			cout << "Введіть кординату точки x: ";
			cin >> x;
			cout << "Введіть кординату точки y: ";
			cin >> y;
			if (x <= 0 && x >= -a / 2 && y >= 0 && y <= a / 2 && y <= x + a / 2) {			//Виконання основної задачі та виведення результату
				cout << "\nТочка належить 1 області" << endl;
			}
			else if (x <= 0 && x >= -a / 2 && y <= 0 && y >= -a / 2 && x * x >= (a / 2) * (a / 2) - (y + a / 2) * (y + a / 2)) {
				cout << "\nТочка належить 2 області" << endl;
			}
			else if (x <= 0 && x >= -a / 2 && y <= -a / 2 && y >= -a && x * x >= (a / 2) * (a / 2) - (y + a / 2) * (y + a / 2) && y <= x - a / 2) {
				cout << "\nТочка належить 3 області" << endl;
			}
			else if (x >= 0 && x <= a / 2 && y <= -a / 2 && y >= -a && x * x >= (a / 2) * (a / 2) - (y + a / 2) * (y + a / 2)) {
				cout << "\nТочка належить 4 області" << endl;
			}
			else {
				cout << "\nТочка не належить жодній області" << endl << endl;
			}
			break;
		case 4:
			exit = false;
			break;
		default:
			cout << "Невірний вибір. Спробуйте ще раз." << endl;
			break;
		}
	}
}

