#include <iostream>
#include <cstdlib> // Потрібен для функції system()
#include <cmath>  //підключення бібліотеки математичних функцій
using namespace std;

int main()
{
	// Переключаємо консоль Windows на UTF-8 (підтримка українських букв)
	system("chcp 65001 > nul");
	// Integer 16. Дано тризначне число.
	// Вивести число, отримане при перестановці	цифр десятків і одиниць вихідного числа
	// (наприклад, 123 перейде в 213).
	
	unsigned short num_111, num_100, num_10, num_1;	//декларація цілих змінних
	cout << "Integer 16." << endl;
	cout << "Вивести число, отримане при перестановці цифр десятків і одиниць вихідного числа \n";
	while (true)	//запускаю цикл, який буде повторюватися поки користувач не введе трьохзначне число
	{
		cout << endl  << "Введіть тризначне число: ";
		if (!(cin >> num_111))			// перевірка на введення букви
		{
			cin.clear();
			cin.ignore(10000, '\n');
			cout << "Помилка! Вводьте тільки цифри.\n";
			continue;
		}
		if (num_111 <= 999 && num_111 >= 100)    // перевірка на тризначність числа
		{
			num_100 = num_111 / 100;            // визначення цифри сотень
			num_10 = (num_111 % 100) / 10;		// визначення цифри десятків
			num_1 = num_111 % 10;				// визначення цифри одиниць
			cout << "Отримане число: " <<num_100 * 100 + num_1 * 10 + num_10  <<"\n\n\n";   // виведення результату
			break;			// вихід з циклу
		}
		else 
		{
			cout << "Введене число не є тризначним." << endl;	// повідомлення про помилку
			cout << "Спробуйте ще раз!" << endl;		
		}
	}

	// Boolean 5. Дано два цілих числа: A, B.
	// Перевірити істинність висловлювання:
	// «Справедливі нерівності A ≥ 0 або B <-2».
	long a, b;		//декларація цілих змінних
	cout << "Boolean 5." << endl;
	cout << "Перевірити істинність висловлювання: «Справедливі нерівності A ≥ 0 або B <-2» \n";
	cout << endl << "Введіть значення A: ";
	cin >> a;			// введення данних
	cout << "Введіть значення В: ";
	cin >> b;			// введення данних
	bool result = (a >= 0 || b < -2);
	cout << "Результат: " << boolalpha << result << "\n\n\n";
	
	// Equation 29
	// Обчислити математичний вираз зі змінними дійсного типу
	double x, y, numerator, denominator;		//декларація цілих змінних
	cout << "Equation 29." << endl;
	cout << "Обчислити математичний вираз зі змінними дійсного типу" << endl << endl;
	cout << "Введіть значення аргумента х: ";
	cin >> x;									// введення данних
	numerator = cbrt(abs(pow(x, 3) / 4 - pow(sin(pow(x, 3)), 2) * 2)) * log(abs(x)) / log(5);  // обчислення чисельника
	denominator = exp2(x) * sqrt(abs(3 * x + 2.5 * abs(tan(x))));								// обчислення знаменника
	y = numerator / denominator;
	cout << "Результат: " << y << endl;
	cout << endl  << "Чисельник: " << numerator << endl;
	cout << "Знаменник: " << denominator << endl;
	return 0;
}